FineMeshWInlet/0/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.1                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
   
    inletFace
    {
       type             zeroGradient;
    }
    inletWall
    {
        type            zeroGradient;
    }
    inletsourceFace
    {
        type            zeroGradient;
    }
    inletdestinationFace
    {
        type            zeroGradient;
    }
    fineMeshWall
    {
        type            zeroGradient;
    }
    fineMeshSourceFace
    {
        type            zeroGradient;
    }
    fineMeshdestinationFace
    {
        type            zeroGradient;
    }
    fineMeshSymmetryWall
    {
        type            symmetryPlane;
    }
    fineMeshOutletLeft
    {
        type            fixedValue;
        value           uniform 0;
    }
    fineMeshOutletBottom
    {
        type           zeroGradient;
    }

}

// ************************************************************************* //
