FineMeshWInlet/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.1                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    p
    {
        solver          GAMG;
        tolerance       1e-06;
        relTol          1e-06;
//        relTol          1e-06;
        smoother        GaussSeidel;
    }

    "(U|k|epsilon|omega|R)"
    {
        solver          smoothSolver;
        smoother        symGaussSeidel;
        tolerance       1e-05;
//        relTol          0.1;
          relTol          1e-05;
//        relTol          1e-05;
    }
}

SIMPLE
{
    nNonOrthogonalCorrectors 0;
    consistent      yes;

    residualControl
    {
          p               1e-5;
//        p               1e-2;
          U               1e-5;
//        U               1e-3;
          "(k|epsilom|omega|R)" 1e-5;
//        "(k|epsilon|omega|R)" 1e-3;
    }
}

relaxationFactors
{
   fields
   {
          p      0.85;
   }


    equations
    {
        U               0.15; // 0.9 is more stable but 0.95 more convergent
        k               0.5;
         epsilon         0.5;
         omega           0.5;
         R               0.5;
//        ".*"            0.9; // 0.9 is more stable but 0.95 more convergent
    }


}


potentialFlow
{
    nNonOrthogonalCorrectors 10;
}

// ************************************************************************* //


